<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img
 src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/alx-courses/aice/assets/Content_page_banner_blue_dots.png"
 alt="ALX Content Header"
 class="full-width-image"
/>
</div>

# Creating views 1

In this exercise, we learn how to create different types of views and how to drop views. 

Ensure that you have downloaded the database file Chinook.db.

## Learning objectives

By the end of this train, you should be able to:
- Create `LOOKUP`, `JOIN`, and `AGGREGATING` views.
- Drop a view.

First, let's load our sample database:

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

In [2]:
# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///chinook.db

'Connected: @chinook.db'

Here is a [view](https://www.lucidchart.com/pages/er-diagrams) of all of our tables in the database:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://github.com/Explore-AI/Pictures/blob/master/sqlite-sample-database-color.jpg?raw=true"  style="width:500px";/>
<br>
<br>
    <em>Figure 1: Chinook ERD</em>
</div>

## Exercise

Run the necessary queries that will provide us with the following information. Compare your queries with the solutions at the end of this notebook.

### Exercise 1

Create a `LOOKUP` view of the surname, first name, title, and country of each employee called `Employee_View`.

In [20]:
%%sql
CREATE VIEW Employee_View
AS

SELECT
    LastName,
    FirstName,
    Country,
    Title
FROM
    Employees;

 * sqlite:///chinook.db
Done.

[]

In [10]:
%%sql
SELECT
*
FROM Employees
LIMIT 1

 * sqlite:///chinook.db
Done.

[(1, 'Adams', 'Andrew', 'General Manager', None, '1962-02-18 00:00:00', '2002-08-14 00:00:00', '11120 Jasper Ave NW', 'Edmonton', 'AB', 'Canada', 'T5K 2N1', '+1 (780) 428-9482', '+1 (780) 428-3457', 'andrew@chinookcorp.com')]

### Exercise 2


Query the `Employee_View` view to get a view of the sales team.

Use the wildcard operators and the LIKE query to filter all the employees in the specified view.

In [21]:
%%sql

SELECT
    LastName,
    FirstName,
    Country,
    Title
FROM
    Employee_view
WHERE
    Title LIKE '%sales%';

 * sqlite:///chinook.db
Done.

[('Edwards', 'Nancy', 'Canada', 'Sales Manager'),
 ('Peacock', 'Jane', 'Canada', 'Sales Support Agent'),
 ('Park', 'Margaret', 'Canada', 'Sales Support Agent'),
 ('Johnson', 'Steve', 'Canada', 'Sales Support Agent')]

### Exercise 3


Create a `JOIN` view that will link up all the customers with the support staff assisting them, called `Customer_Support_View`. We want to view the following:

- First name of the customer
- Last name (surname) of the customer
- Country where the customer resides
- SupportRepId
- EmployeeId
- Last name of the employee
- First name of the employee
- Job title of the employee
- Country where the employee operated from

In [35]:
%%sql
CREATE VIEW Customer_Support_View
AS

SELECT
    c.FirstName AS CustomerF,
    c.LastName AS CustomerL,
    c.Country AS CustomerCountry,
    c.SupportRepId AS CustomerSupportRepId,
    e.EmployeeId,
    e.LastName,
    e.FirstName,
    e.Title,
    e.Country
FROM
    Customers AS c
JOIN
    Employees AS e
        ON c.Country = e.Country;

 * sqlite:///chinook.db
Done.

[]

### Exercise 4

Query the `Customer_Support_View` view to get a list of the names and surnames of the clients who were helped by an employee with the `Employeeid` '3'.

In [36]:
%%sql
SELECT
    *
FROM 
    Customer_Support_View
WHERE
    EmployeeId = 3;

 * sqlite:///chinook.db
Done.

[('François', 'Tremblay', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Mark', 'Philips', 'Canada', 5, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Jennifer', 'Peterson', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Robert', 'Brown', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Edward', 'Francis', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Martha', 'Silk', 'Canada', 5, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Aaron', 'Mitchell', 'Canada', 4, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada'),
 ('Ellie', 'Sullivan', 'Canada', 3, 3, 'Peacock', 'Jane', 'Sales Support Agent', 'Canada')]

### Exercise 5

Create an `AGGREGATING` view that counts the number of customers that are currently being serviced per country, called `Customer_per_Country_View`.

We would like to see the country name and the number of customers in this view.

In [43]:
%%sql
CREATE VIEW Customer_per_Country_View
AS

SELECT
    *,  
    COUNT(*) AS number_of_customers_serviced
FROM 
    Customers
GROUP BY
    Country;

 * sqlite:///chinook.db
(sqlite3.OperationalError) view Customer_per_Country_View already exists
[SQL: CREATE VIEW Customer_per_Country_View
AS

SELECT
    *,
    COUNT(*) AS number_of_customers_serviced
FROM
    Customers
GROUP BY
    Country
LIMIT 10;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### Exercise 6
Write a query that returns the country with the most customers from `Customer_per_Country_View`.

In [45]:
%%sql
SELECT *
FROM Customer_per_Country_View
LIMIT 4

 * sqlite:///chinook.db
Done.

[(56, 'Diego', 'Gutiérrez', None, '307 Macacha Güemes', 'Buenos Aires', None, 'Argentina', '1106', '+54 (0)11 4311 4333', None, 'diego.gutierrez@yahoo.ar', 4, 1),
 (55, 'Mark', 'Taylor', None, '421 Bourke Street', 'Sidney', 'NSW', 'Australia', '2010', '+61 (02) 9332 3633', None, 'mark.taylor@yahoo.au', 4, 1),
 (7, 'Astrid', 'Gruber', None, 'Rotenturmstraße 4, 1010 Innere Stadt', 'Vienne', None, 'Austria', '1010', '+43 01 5134505', None, 'astrid.gruber@apple.at', 5, 1),
 (8, 'Daan', 'Peeters', None, 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', '+32 02 219 03 03', None, 'daan_peeters@apple.be', 4, 1)]

### Exercise 7

Write a query that will delete the `Employee_View` view.

In [ ]:
%%sql

DROP VIEW Employee_View

### Challenge question

Write a query that returns the number of customers that each support employee services, along with the name of the employee. Call this view `Support_Person_Stats`.

To do this, we will need to create a view, join the Customer and Employee tables, and use the `COUNT` and `GROUP BY` functions to aggregate the number of employees serviced by each employee.

In [46]:
%%sql
CREATE VIEW Support_Person_Stats AS
SELECT
    e.EmployeeId,
    e.FirstName AS EmployeeFirstName,
    e.LastName AS EmployeeLastName,
    e.Title,
    e.Country AS EmployeeCountry,
    COUNT(c.CustomerId) AS number_of_customers_serviced
FROM Customers AS c
JOIN Employees AS e
    ON c.SupportRepId = e.EmployeeId
GROUP BY
    e.EmployeeId,
    e.FirstName,
    e.LastName,
    e.Title,
    e.Country;

 * sqlite:///chinook.db
Done.

[]

## Solutions

In [47]:
%%sql
SELECT *
FROM Support_Person_Stats

 * sqlite:///chinook.db
Done.

[(3, 'Jane', 'Peacock', 'Sales Support Agent', 'Canada', 21),
 (4, 'Margaret', 'Park', 'Sales Support Agent', 'Canada', 20),
 (5, 'Steve', 'Johnson', 'Sales Support Agent', 'Canada', 18)]

### Exercise 1

In [ ]:
%%sql

CREATE VIEW Employee_View AS 
SELECT LastName, FirstName, Title, Country
FROM Employees;

### Exercise 2

In [ ]:
%%sql

SELECT * FROM Employee_View
WHERE Title LIKE '%Sales%'

### Exercise 3

In [ ]:
%%sql

CREATE VIEW Customer_Support_View AS
SELECT c.FirstName Customer_Name, c.LastName Customer_Surname, c.Country Customer_Country, c.SupportRepId, e.EmployeeId, e.LastName Employee_surname, e.FirstName Employee_first_name, e.Title Employee_job_title, e.Country Employee_Country
FROM customers c 
INNER JOIN employees e
ON c.SupportRepId = e.EmployeeId

### Exercise 4

In [ ]:
%%sql

SELECT Customer_Name, Customer_Surname 
FROM Customer_Support_View
WHERE Employeeid = 3;

### Exercise 5

In [ ]:
%%sql

CREATE VIEW Customer_per_Country_View AS 
SELECT COUNT (CustomerId) AS Num_customers, Country
FROM customers
GROUP BY Country;

### Exercise 6

In [ ]:
%%sql

SELECT Country, MAX(Num_customers) 
FROM Customer_per_Country_View

### Exercise 7

In [ ]:
%%sql

DROP VIEW Employee_View

### Challenge question

In [49]:
%%sql

CREATE VIEW Support_Person_Stats 
AS

SELECT 
    COUNT(c.SupportRepId) Count_of_Customers_Serviced , e.EmployeeId, e.LastName
FROM 
    customers c 
INNER JOIN 
    employees e
        ON c.SupportRepId = e.EmployeeId
GROUP BY 
    e.EmployeeId;

 * sqlite:///chinook.db
Done.

[(21, 3, 'Peacock'), (20, 4, 'Park'), (18, 5, 'Johnson')]

* Note: Because views are added to the main database after they are created, if we want to perform the `CREATE VIEW` commands again, we must first drop the prior view to prevent receiving a 'VIEW already exists' error.

#

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/refs/heads/master/ALX_banners/ALX_Navy.png"  style="width:100px"  ;/>
</div>